{
    "apps": [
        {
            "name": "Application Template",
            "path": "app-template",
            "description": "A barebones application template, from which the others were created."
        },

        {
            "name": "Dendrogram",
            "path": "dendrogram",
            "description": "The Tangelo <b>dendrogram</b> plugin, illustrating the organizational structure on board the starship Enterprise"
        },

        {
            "name": "Geo Dots",
            "path": "geodots",
            "description": "The Tangelo <b>geodots</b> plugin, demonstrating the placement of colored dots on a GeoJSON world map."
        },

        {
            "name": "Geo Node-Link Diagram",
            "path": "geonodelink",
            "description": "The Tangelo <b>geonodelink</b> plugin, demonstrating a colored node-link diagram on a GeoJSON world map."
        },

        {
            "name": "Map Dots",
            "path": "mapdots",
            "description": "The Tangelo <b>mapdots</b> plugin, demonstrating the placement of colored dots on a Google Map."
        },

        {
            "name": "Node Link Diagram",
            "path": "nodelink",
            "description": "The Tangelo <b>nodelink</b> plugin, demonstrating how to create an interactive node link diagram."
        },

        {
            "name": "Prime Number Stream",
            "path": "primes",
            "description": "A demonstration Tangelo's data streaming feature, computing an endless stream of prime numbers."
        },

        {
            "name": "Vega Builder",
            "path": "vegabuilder",
            "description": "A live, HTML-based Vega specification editor, with immediate feedback."
        },

        {
            "name": "VTKWeb Integration",
            "path": "vtkweb",
            "description": "A demonstration of Tangelo's VTKWeb capabilities: launch a VTKWeb process, interact with it, and shut it down via HTML controls."
        },

        {
            "name": "Document Entity Relationships",
            "path": "ner",
            "description": "Discover the network of <em>named entities</em> hidden within text documents"
        },

        {
            "name": "Flickr Metadata Maps",
            "path": "flickr",
            "description": "Explore the locations where millions of Flickr photos were taken"
        },

        {
            "name": "Enron",
            "path": "enron",
            "description": "Enron email visualization."
        }
    ],

    "external": [
        {
            "name": "Vega",
            "link": "http://trifacta.github.com/vega",
            "description": "A visualization grammar developed by <a href=http://trifacta.com>Trifacta, Inc.</a>, based on JSON, for specifying and representing visualizations.  Tangelo makes use of Vega in some jQuery plugins to create rich, data-driven visualization widgets."
        },

        {
            "name": "VTK",
            "link": "http://www.vtk.org",
            "description": "The Visualization Toolkit, developed by <a href=http://www.kitware.com>Kitware, Inc.</a>, is a well known library for creating rich visualization applications.  Tangelo integrates with VTKWeb, a technology that can run VTK over web sockets, allowing Tangelo applications to include VTK programs."
        },

        {
            "name": "D3",
            "link": "http://d3js.org/",
            "description": "An extensive Javascript library enabling the binding of data to DOM elements, and subsequent, data-driven manipulation of the DOM.  Tangelo bases some of its clientside library on D3, allowing for the creation of rich interactive data plugins and visualizations."
        },

        {
            "name": "jQuery",
            "link": "http://jquery.com/",
            "description": "A de facto staple for web development, standardizing website behavior over different web browsers, and offering an extensible plugin system that allows for easy creation of new, encapsulated behaviors for use in your web applications.  Tangelo makes use of the jQuery library and offers several jQuery plugins to supercharge your visualization applications."
        }
    ]
}
